[
    {
      "name": "E O A Perera Theatre at UOP",
      "featured": "yes",
      "year": 2025,
      "scope": "Lighting control System",
      "description": "We are proud to have completed the installation of a state-of-the-art lighting control system at the E. O. E. Perera Theatre, located within the Engineering Faculty of the University of Peradeniya. This iconic theatre, with a seating capacity of 542, now features a modern, intuitive lighting system designed to support a wide range of academic and cultural events. Our installation enhances both the functionality and flexibility of the venue, offering seamless control and ambiance adjustment for lectures, performances, and presentations.  ",
      "clientUrl": "https://eeu.pdn.ac.lk/EOE_Pereira_Theatre",
      "location": "Peradeniya, Sri Lanka",
      "imageUrl": "/images/projects/eoe-perera-auditorium.jpg",
      "slug": "eoa-perera-Auditorim-peradeniya"
    },
    {
      "name": "Auditorium at ICBT Campus",
      "featured": "yes",
      "year": 2025,
      "scope": "Lighting control System",
      "description": "We installed an advanced state-of-the-art lighting control system at the auditorium of ICBT Campus, Kurunegala. Designed to enhance both energy efficiency and user convenience, this intelligent system allows seamless control over the auditorium’s lighting environment—perfect for lectures, presentations, and events.",
      "clientUrl": "https://icbt.lk/facilities/",
      "location": "Kurunegala, Sri Lanka",
      "imageUrl": "/images/projects/auditorium-icbt-kurunegala.jpg",
      "slug": "Auditorium-at-icbt-campus"
    },
    {
      "name": "Worship Hall At JCC",
      "featured": "yes",
      "year": 2025,
      "scope": "Lighting control System & LED Moon Light",
      "description": "We designed and installed a custom moonlight LED panel to softly illuminate the statue in the worship hall, enhancing the serene and spiritual atmosphere. The setup includes a smart lighting control system for easy scene adjustment, dimming, and scheduling — all tailored to the centre’s ceremonial needs. Respectful. Refined. Precisely controlled.",
      "clientUrl": "https://jasteca.net/index.php",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/japanese-cultural-centre.jpg",
      "slug": "japanese-cultural-centre"
    },
    {
      "name": "Airport Cargo Building",
      "featured": "no",
      "year": 2024,
      "scope": "LED Lighting System & Philips Luminairies",
      "description": "Onco Solutions successfully completed the installation of a modern linear lighting system combined with Philips luminaires at the Cargo Building of Bandaranaike International Airport. The project enhances visibility, improves energy efficiency, and supports 24/7 operations with a durable, low-maintenance lighting solution. Designed to meet international standards, this upgrade ensures safer, more efficient cargo handling while aligning with the airport’s modernization goals.",
      "clientUrl": "https://client-website.com",
      "location": "Katunayaka, Sri Lanka",
      "imageUrl": "/images/projects/cargo-building-katunayaka.jpg",
      "slug": "airport-cargo-building"
    },
    {
      "name": "Barcelo - Nasadura Palace",
      "featured": "yes",
      "year": 2024,
      "scope": "Lighting control System",
      "description": "Onco Solutions completed the installation of a smart lighting control system at Barceló Násandhura Palace Hotel, covering both general areas and banquet halls. The system offers seamless control, energy efficiency, and customizable ambiance, enhancing the hotel's guest experience while supporting smooth day-to-day operations.",
      "clientUrl": "https://www.barcelo.com/en-ww/barcelo-nasandhura-male/",
      "location": "Male, Maldives",
      "imageUrl": "/images/projects/barcilo-nasadura-male.jpg",
      "slug": "barcilo-nasadura-palace"
    },
    {
      "name": "Airport Terminal Building",
      "featured": "no",
      "year": 2024,
      "scope": "Lighting control System & Luminaries",
      "description": "Description of the project...",
      "clientUrl": "https://client-website.com",
      "location": "Katunayaka, Sri Lanka",
      "imageUrl": "/images/projects/airport-terminal-building.jpg",
      "slug": "airport-terminal-building"
    },
    {
      "name": "Auditorium at University of Rajarata",
      "featured": "yes",
      "year": 2024,
      "scope": "Lighting, audio, stage lighting & projector system",
      "description": "Onco Solutions successfully completed the installation of a state-of-the-art lighting, audio, stage lighting, and projector system at the auditorium of the University of Rajarata, Sri Lanka. This upgrade enhances the venue's functionality and atmosphere, creating an immersive experience for academic events, performances, and presentations.",
      "clientUrl": "https://fot.rjt.ac.lk/",
      "location": "Mihintale, Sri Lanka",
      "imageUrl": "/images/projects/auditorium-university-of-rajarata.jpg",
      "slug": "auditorium-university-of-rajarata"
    },
    {
      "name": "Auditorium at University of Kelaniya",
      "featured": "no",
      "year": 2024,
      "scope": "Lighting, audio, stage lighting & projector system",
      "description": "Onco Solutions successfully completed the installation of a state-of-the-art lighting, audio, stage lighting, and projector system at the auditorium of the University of Kelaniya, Sri Lanka. This upgrade enhances the venue's functionality and atmosphere, creating an immersive experience for academic events, performances, and presentations.",
      "clientUrl": "https://fct.kln.ac.lk/",
      "location": "Kelaniya, Sri Lanka",
      "imageUrl": "/images/projects/auditorium-university-of-kelaniya.jpg",
      "slug": "auditorium-university-of-kelaniya"
    },
    {
      "name": "Maitland Cresent Banquet",
      "featured": "no",
      "year": 2023,
      "scope": "LED RGB Lighting, DMX control, linear lighting & lighting control System",
      "description": "Onco Solutions successfully completed the supply, programming, installation, and commissioning of an advanced lighting control system for general lighting, DMX control, and RGB linear lighting at the Sri Lanka Army’s Maitland Crescent Banquet Hall. The solution delivered dynamic ambiance and precise control, enhancing both the functionality and visual impact of the venue.",
      "clientUrl": "/",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/maitland-cresent-banquet.jpg",
      "slug": "maitland-cresent-banquet"
    },
    {
      "name": "Naval Base Wave n'Lake Banquet",
      "featured": "yes",
      "year": 2023,
      "scope": "LED RGB Lighting, DMX control, linear lighting & lighting control System",
      "description": "Onco Solutions successfully delivered the complete supply, programming, installation, and commissioning of an advanced lighting control system for general lighting, DMX control, and RGB linear lighting at the Wave n' Lake Banquet of the Sri Lanka Navy. Our solution seamlessly integrates functionality with ambience, enhancing the venue’s atmosphere with precision and elegance.",
      "clientUrl": "https://www.facebook.com/wavenlakenavy/",
      "location": "Welisara, Sri Lanka",
      "imageUrl": "/images/projects/wave-n-lake.jpg",
      "slug": "wave-n-lake"
    },
    {
      "name": "Auditorium at Waterboard",
      "featured": "yes",
      "year": 2023,
      "scope": "LED RGB Lighting, DALI, DMX control, linear lighting & lighting control System",
      "description": "At the Waterboard Auditorium Complex in Ratmalana, Onco Solutions delivered a complete lighting transformation for the Water and Sanitation Board of Sri Lanka. The project integrated advanced LED RGB lighting, precision DALI and DMX control systems, and sleek linear lighting to enhance both functionality and ambiance. This intelligent lighting control solution was designed to elevate the auditorium's visual experience while ensuring energy efficiency and seamless system management.",
      "clientUrl": "https://cewas.nwsdb.lk/web/index.php/auditorium/",
      "location": "Rathmalana, Sri Lanka",
      "imageUrl": "/images/projects/waterboard-rathmalana.jpg",
      "slug": "waterboard-rathmalana"
    },
    {
      "name": "Avani Resort & Hotel",
      "featured": "yes",
      "year": 2023,
      "scope": "Supply programming installation & integration of general area lighting, DMX control",
      "description": "At the stunning Avani Resort in Fares, Maldives, Onco Solutions delivered a seamless blend of functionality and ambiance through expertly designed general area lighting, advanced DMX control, and an integrated lighting control system. Our solution enhances guest experience by creating immersive, adaptable lighting environments that complement the resort’s serene luxury.",
      "clientUrl": "https://www.avanihotels.com/en/fares-maldives",
      "location": "Fares, Maldives",
      "imageUrl": "/images/projects/avani-male.jpg",
      "slug": "avani-male"
    },
    {
      "name": "Auditorium at IIHS",
      "featured": "no",
      "year": 2023,
      "scope": "Lighting control System",
      "description": "Onco Solutions proudly delivered a state-of-the-art auditorium lighting control system for the International Institute of Health Sciences (IIHS) in Welisara. Tailored to meet the dynamic needs of academic and professional events, the system offers seamless control, energy efficiency, and enhanced ambiance—ensuring every presentation, seminar, and performance is experienced at its best.",
      "clientUrl": "https://iihs.edu.lk/",
      "location": "Welisara, Sri Lanka",
      "imageUrl": "/images/projects/iihs-welisara.jpg",
      "slug": "iihs-welisara"
    },
    {
      "name": "Auditorium at KMC",
      "featured": "yes",
      "year": 2022,
      "scope": "Electrical wiring, General & Stage lighting system",
      "description": "Onco Solutions delivered a complete lighting and electrical system for the KMC Auditorium, seamlessly integrating general and stage lighting with advanced control features. From precise illumination design to full-scale electrical wiring, the project ensured a dynamic and reliable environment for performances and events.",
      "clientUrl": "https://kandy.mc.gov.lk/",
      "location": "Kandy, Sri Lanka",
      "imageUrl": "/images/projects/kmc-auditorium.jpg",
      "slug": "kmc-auditorium"
    },
    {
      "name": "Grand Silver Ray",
      "featured": "yes",
      "year": 2022,
      "scope": "LED Lighting System",
      "description": "Description of the project...",
      "clientUrl": "https://silverray.lk/",
      "location": "Ratnapura, Sri Lanka",
      "imageUrl": "/images/projects/silver-ray.jpg",
      "slug": "silver-ray"
    },
    {
      "name": "Sofia Colombo - By Raddison",
      "featured": "yes",
      "year": 2022,
      "scope": "Guest Room Control System for 212 Rooms",
      "description": "Onco Solutions successfully delivered a complete Guest Room Control System for 212 rooms at PARK INN by Radisson. The project included smart automation for lighting, air conditioning, and service controls, enhancing guest comfort and energy efficiency. Our seamless integration and timely execution reflect our commitment to quality and innovation in hospitality technology.",
      "clientUrl": "https://www.sofiacolombo.com/",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/sofia-colombo.jpg",
      "slug": "sofia-colombo"
    },{
      "name": "Altair Residence Colombo",
      "featured": "yes",
      "year": 2022,
      "scope": "Smart Home Solution",
      "description": "Onco Solutions successfully completed the installation, programming, and commissioning of a full apartment smart home system at Altair Colombo, covering 240 apartments at Straight Tower. Additionally, we delivered advanced smart thermostat control solutions for 404 apartments, ensuring energy-efficient climate control and seamless smart living.",
      "clientUrl": "https://www.altair.lk/",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/altair-colombo.jpg",
      "slug": "altair-colombo"
    },
    {
      "name": "Conference Hall at GWU",
      "featured": "no",
      "year": 2021,
      "scope": "Lighting, Lighting Control & Audio Visual",
      "description": "Onco Solutions proudly partnered with Wickramarachchi University of Indigenous Medicine in Gampaha (GWU) to deliver a complete lighting, lighting control, and AV solution for the Senate/Conference Hall. From design to installation, our team ensured a seamless integration of modern technology to enhance the space’s functionality and atmosphere, supporting impactful presentations and immersive experiences.",
      "clientUrl": "https://gwu.ac.lk/",
      "location": "Gampaha, Sri Lanka",
      "imageUrl": "/images/projects/wikramarachchi-gampaha.jpg",
      "slug": "wikramarachchi-gampaha"
    },
    {
      "name": "Auditorium at SJP ",
      "featured": "yes",
      "year": 2021,
      "scope": "Lighting control System",
      "description": "Onco Solutions successfully completed the supply and installation of a state-of-the-art lighting control system at the Ven. Sri Soratha Auditorium, Faculty of Technology, University of Sri Jayewardenepura, Homagama. This project highlights our dedication to delivering intelligent lighting solutions that enhance functionality, efficiency, and the overall user experience in modern educational spaces.",
      "clientUrl": "https://tech.sjp.ac.lk/",
      "location": "Homagama, Sri Lanka",
      "imageUrl": "/images/projects/japura-auditorium.jpg",
      "slug": "japura-auditorium"
    },
    {
      "name": "Restaurant Chilis at One Galleface",
      "featured": "yes",
      "year": 2020,
      "scope": "Lighting control System",
      "description": "Onco Solutions successfully completed the supply and installation of a custom lighting control system for CHILIS Restaurant at One Galle Face Mall. Designed to enhance the dining experience, our solution delivers seamless ambiance control through the perfect blend of smart technology and aesthetic lighting design.",
      "clientUrl": "https://chilis.lk/",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/chilis-restaurant.jpg",
      "slug": "chilis-restaurant"
    },
    {
      "name": "Auditorium & Boardroom at Royal Institute",
      "featured": "yes",
      "year": 2020,
      "scope": "Lighting control System",
      "description": "Onco Solutions delivered a tailored lighting control system for the Auditorium and Board Room at the Royal Institute of Colombo Campus Pvt Ltd. The installation ensures optimal lighting performance, intuitive control, and a refined atmosphere for presentations, meetings, and events.",
      "clientUrl": "https://ric.lk/",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/royal-institute-colombo.jpg",
      "slug": "royal-institute-colombo"
    },
    {
      "name": "Music Pool at Hardrock Hotels",
      "featured": "yes",
      "year": 2018,
      "scope": "Music Pool Lighting control System",
      "description": "At Hardrock Hotel in the stunning Malé Atoll, Maldives—developed by Singha Estate Public Company Limited, Thailand—Onco Solutions delivered a custom DMX SPI lighting control system for the Integrated Music Pool. Designed to sync seamlessly with sound and rhythm, our installation transforms every swim into an immersive audio-visual experience.",
      "clientUrl": "https://hotel.hardrock.com/maldives/?utm_source=organic&utm_medium=gmb&utm_campaign=hardrockmaldives",
      "location": "Male Atoll, Maldives",
      "imageUrl": "/images/projects/hardrock-resort-male.jpg",
      "slug": "hardrock-resort-male"
    },
    {
      "name": "Cinnamon Dhonveli Resort",
      "featured": "yes",
      "year": 2019,
      "scope": "General Lighting control System",
      "description": "Onco Solutions proudly partnered with John Keells for the Cinnamon Dhonveli project in the Maldives, delivering a comprehensive supply and installation of the General Area Lighting Control System. This state-of-the-art system enhances energy efficiency and ensures seamless lighting management throughout the resort’s communal spaces, perfectly blending innovation with the island’s serene ambiance.",
      "clientUrl": "https://www.cinnamonhotels.com/cinnamon-dhonveli-maldives?utm_source=google&utm_medium=organic&utm_campaign=cinnamondhonvelimaldives&utm_term=gbp",
      "location": "Dhonveli, Maldives",
      "imageUrl": "/images/projects/cinnamon-dhonveli.jpg",
      "slug": "cinnamon-dhonveli"
    },
    {
      "name": "Rolex Showroom at One Galleface",
      "featured": "no",
      "year": 2020,
      "scope": "DALI Lighting Control",
      "description": "Onco Solutions was proud to deliver the supply and installation of a sophisticated DALI lighting control system for the ROLEX showroom at One Galle Face. Designed to enhance the showroom's luxury ambiance, the system ensures seamless control, precision, and elegance in lighting performance throughout the space.",
      "clientUrl": "https://www.rolex.com/rolex-dealers/chathamluxurywatches-4685/rswi_18907-colombo-srilanka",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/rolex-showroom-colombo.jpg",
      "slug": "rolex-showroom-colombo"
    },
    {
      "name": "Ahaspokuna Resort",
      "featured": "no",
      "year": 2020,
      "scope": "Banquet DMX & General Lighting control System",
      "description": "Onco Solutions completed the supply and installation of a Banquet DMX and General Lighting Control System at Ahaspokuna Resort, Kurunegala. The project enhanced the resort’s banquet space with sophisticated lighting control for both atmosphere and efficiency.",
      "clientUrl": "https://ahaspokunaholidayresorts.com/",
      "location": "Kurunegala, Sri Lanka",
      "imageUrl": "/images/projects/ahaspokuna-resort.jpg",
      "slug": "ahaspokuna-resort"
    },
    {
      "name": "Auditorium at Sumedha College",
      "featured": "no",
      "year": 2021,
      "scope": "Lighting control System",
      "description": "Onco Solutions successfully completed the supply and installation of an advanced lighting control system for the auditorium at Sumedha College, Gampaha. Designed to enhance stage performances and events, the system offers seamless control, energy efficiency, and reliable performance tailored to the needs of a modern educational environment.",
      "clientUrl": "http://scg.ydc.lk/",
      "location": "Gampaha, Sri Lanka",
      "imageUrl": "/images/projects/sumedha-gampaha.jpg",
      "slug": "sumedha-gampaha"
    },
    {
      "name": "Avani Kalutara Resort",
      "featured": "yes",
      "year": 2019,
      "scope": "Banquet DMX & General Lighting Control",
      "description": "Onco Solutions proudly delivered the lighting control system for Avani Resort in Kalutara, handling the supply and installation of both DMX-controlled banquet lighting and general area lighting controls. Our system enhances ambiance and efficiency, tailored to meet the resort’s dynamic hospitality needs.",
      "clientUrl": "https://www.avanihotels.com/en/kalutara",
      "location": "Kalutara, Sri Lanka",
      "imageUrl": "/images/projects/avani-kalutara.jpg",
      "slug": "avani-kalutara"
    },
    {
      "name": "Hilton Double Tree",
      "featured": "yes",
      "year": 2019,
      "scope": "Lighting control System for Delux & President Suites & General areas",
      "description": "At Hilton DoubleTree by Rajawarana Resorts, Weerawila, Onco Solutions delivered a comprehensive lighting control solution, enhancing comfort and efficiency across the Deluxe Suites, Presidential Suites, and all general areas. Our seamless installation blends smart technology with luxury, ensuring an elevated guest experience throughout the resort.",
      "clientUrl": "https://www.hilton.com/en/hotels/wrzrjdi-doubletree-weerawila-rajawarna-resort/?WT.mc_id=zPADA0LK1MB2PSH3paid_ggl4INTBPP_Apr5SiteGGL_ObjROAS_TacBPP_TarKeyword_SMWW_FrmtRSAs_CrNText_DvceAll_LPOHW6MULTIBR7EN8acctid=700000002399003-campid=71700000093512843-adgrpid=58700007792392934&&&&&gad_source=1&gad_campaignid=17068487474&gbraid=0AAAAADnjLGNzhr0LzZ_FBjzoqvuK_PCLa&gclid=Cj0KCQjw_JzABhC2ARIsAPe3ynoDU_3BHaF9HjREjJ9qcPbM_ggtgPp7HJwMcAA4-PqFWvGY9lpMVHYaAgrbEALw_wcB&gclsrc=aw.ds",
      "location": "Weeravila, Sri Lanka",
      "imageUrl": "/images/projects/hilton-doubletree-weeravila.jpg",
      "slug": "hilton-doubletree-weeravila"
    },
    {
      "name": "Auditorium at Jaffna Thiruvalluvar Cultural Centre",
      "featured": "no",
      "year": 2018,
      "scope": "Auditorium Lighting control System",
      "description": "At the Jaffna Thiruvalluvar Cultural Centre, Onco Solutions delivered a seamless lighting control solution for the main auditorium. Our system was designed and installed to enhance stage versatility and create dynamic lighting experiences, tailored to suit cultural performances and events.",
      "clientUrl": "/",
      "location": "Jaffna, Sri Lanka",
      "imageUrl": "/images/projects/jaffna-cultural-centre.jpg",
      "slug": "jaffna-cultural-centre"
    },
    {
      "name": "Toyota Lanka Warehouse Facility",
      "featured": "no",
      "year": 2019,
      "scope": "Warehouse Lighting control System",
      "description": "At Toyota Lanka's Warehouse Facility in Wattala, Onco Solutions delivered a complete lighting control solution, tailored for efficiency and performance. From supply to installation, our system ensures optimal illumination while enhancing energy management across the warehouse space.",
      "clientUrl": "https://www.toyota.lk/",
      "location": "Wattala, Sri Lanka",
      "imageUrl": "/images/projects/toyota-lanka.jpg",
      "slug": "toyota-lanka"
    },
    {
      "name": "Auditorium at Kelaniya Vidyalankara Buddhist Institute",
      "featured": "no",
      "year": 2018,
      "scope": "Auditorium DMX & Lighting Control System",
      "description": "Onco Solutions proudly delivered a complete DMX and lighting control system for the auditorium at the Kelaniya Vidyalankara Buddhist Institute. This project brought advanced lighting technology to a space dedicated to cultural and academic excellence, ensuring seamless control and dynamic illumination for every event.",
      "clientUrl": "https://www.kln.ac.lk/home",
      "location": "Kelaniya, Sri Lanka",
      "imageUrl": "/images/projects/vidyalankara-kelaniya.jpg",
      "slug": "vidyalankara-kelaniya"
    },
    {
      "name": "Experience Centre ITC Ratnadipa Colombo",
      "featured": "no",
      "year": 2018,
      "scope": "Experience Centre Lighting Control System",
      "description": "Onco Solutions handled the supply and installation of the lighting control system at the Experience Centre, ITC Ratnadipa, Colombo. The system was designed to enhance the space with intelligent, seamless lighting tailored for both functionality and atmosphere.",
      "clientUrl": "https://www.itchotels.com/in/en/itcratnadipa-colombo",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/itc-hotels-colombo.jpg",
      "slug": "itc-hotels-colombo"
    },
    {
      "name": "Banquet of Lavenro Garden Hotel",
      "featured": "no",
      "year": 2017,
      "scope": "DMX SPI Lighting Control System",
      "description": "Onco Solutions completed the supply and installation of a DMX SPI lighting control system at Lavenro Garden Hotel, Kosgama. Designed for three banquet halls and the main lobby, the system enhances ambiance and creates a refined, dynamic atmosphere through seamless lighting control.",
      "clientUrl": "https://lavenrogarden.com/",
      "location": "Kosgama, Sri Lanka",
      "imageUrl": "/images/projects/lavenro-garden-kosgama.jpg",
      "slug": "lavenro-garden-kosgama"
    },
    {
      "name": "Jetwing City Colombo Hotel",
      "featured": "yes",
      "year": 2016,
      "scope": "DMX SPI Lighting Control System",
      "description": "Onco Solutions completed the supply and installation of a DMX SPI lighting control system at Lavenro Garden Hotel, Kosgama. Designed for three banquet halls and the main lobby, the system enhances ambiance and creates a refined, dynamic atmosphere through seamless lighting control.",
      "clientUrl": "https://www.jetwinghotels.com/jetwingcolomboseven/#gref",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/jetwing-city-colombo.jpg",
      "slug": "jetwing-city-colombo"
    },
    {
      "name": "Jetwing Lake Dambulla",
      "featured": "no",
      "year": 2016,
      "scope": "Conference Hall Lighting Control System",
      "description": "At Jetwing Lake Dambulla, Onco Solutions delivered a complete lighting control system for the conference hall. From supply to installation, the project enhanced ambiance and energy efficiency, offering seamless control tailored for high-end events and gatherings.",
      "clientUrl": "https://www.jetwinghotels.com/jetwinglake/#gref",
      "location": "Dambulla, Sri Lanka",
      "imageUrl": "/images/projects/jetwing-conference-room.jpg",
      "slug": "jetwing-conference-room"
    },
    {
      "name": "Auditorium at NSBM - Green University",
      "featured": "yes",
      "year": 2016,
      "scope": "Dimming Control System",
      "description": "At Jetwing Lake Dambulla, Onco Solutions delivered a complete lighting control system for the conference hall. From supply to installation, the project enhanced ambiance and energy efficiency, offering seamless control tailored for high-end events and gatherings.",
      "clientUrl": "https://www.nsbm.ac.lk/",
      "location": "Homagama, Sri Lanka",
      "imageUrl": "/images/projects/nsbm-green-homagama.jpg",
      "slug": "nsbm-green-homagama"
    },
    {
      "name": "Hayleys Warehouse",
      "featured": "no",
      "year": 2015,
      "scope": "Warehouse Lighting control System",
      "description": "Onco Solutions partnered with Heyleys Warehouse in Katunayake to deliver a complete supply and installation of advanced warehouse lighting controls. This project focused on enhancing energy efficiency and operational control, ensuring optimal lighting performance tailored to the demands of a large-scale logistics environment.",
      "clientUrl": "https://hayleysadvantis.com/services/free-zone-logistics/",
      "location": "Katunayaka, Sri Lanka",
      "imageUrl": "/images/projects/hayleys-warehouse-katunayaka.jpg",
      "slug": "hayleys-warehouse-katunayaka"
    },
    {
      "name": "Sentido Heritance Hotels",
      "featured": "yes",
      "year": 2015,
      "scope": "Lighting control System",
      "description": "Onco Solutions proudly delivered the supply and installation of a cutting-edge lighting control system for Sentido Heritance Hotels. Our work covered key areas including general spaces, banquet halls, restaurants, the spa, and the main lobby—enhancing ambience, efficiency, and guest experience through seamless lighting automation.",
      "clientUrl": "https://www.heritancehotels.com/sentido-heritance/",
      "location": "Katunayaka, Sri Lanka",
      "imageUrl": "/images/projects/heritance-negambo.jpg",
      "slug": "heritance-negambo"
    },
    {
      "name": "Royal Palms Beach Hotel",
      "featured": "no",
      "year": 2014,
      "scope": "Lighting control System",
      "description": "At Royal Palm Beach Hotels in Kalutara, Onco Solutions delivered a seamless lighting control system for the restaurant and bar area. The project focused on enhancing ambience and functionality, combining smart lighting technology with elegant design to elevate the guest experience.",
      "clientUrl": "https://royalpalmsbeachhotel.com-srilanka.com/",
      "location": "Kalutara, Sri Lanka",
      "imageUrl": "/images/projects/royal-palms-beach-hotel.jpg",
      "slug": "royal-palms-beach-hotel"
    },
    {
      "name": "Hambanthota International Convention Centre",
      "featured": "no",
      "year": 2013,
      "scope": "Complete Building Lighting control System",
      "description": "Onco Solutions provided the complete supply and installation of a sophisticated lighting control system for the Hambantota International Convention Centre in Hambantota, Sri Lanka. The project covered the entire facility, including the auditorium, banquet hall, committee rooms, and all general areas, delivering seamless, intelligent lighting management throughout.",
      "clientUrl": "/",
      "location": "Hambanthota, Sri Lanka",
      "imageUrl": "/images/projects/hambanthota-convention-centre.jpg",
      "slug": "hambanthota-convention-centre"
    },
    {
      "name": "Radisson Hotel Colombo",
      "featured": "yes",
      "year": 2014,
      "scope": "Lighting control System",
      "description": "At Radisson Hotel Colombo, Onco Solutions delivered a complete lighting solution across key areas including the Banquet Hall, All Day Dining, Pool & Bar, and the Entrance Lobby. Our team handled the full supply and installation process, integrating advanced C-Bus lighting controls to enhance ambiance, functionality, and energy efficiency throughout the space.",
      "clientUrl": "https://www.radissonhotels.com/en-us/hotels/radisson-colombo?facilitatorId=RHGSEM&cid=a%3Aps+b%3Aggl+c%3Aemea+i%3Abrand+e%3Arad+d%3Aseap+r%3Abrt+f%3Aen-US+g%3Aho+h%3ALKCMB2+v%3Acf&gad_source=1&gad_campaignid=21228354603&gbraid=0AAAAADtKuEWMuZA_H5VbfwxeoHno9XDOq&gclid=CjwKCAjwn6LABhBSEiwAsNJrjgHAJQvjl55ojkWB7Q3CfZyDDGpnTES9Hxgj2w3Co_0FQg874sqOlRoCd3kQAvD_BwE&gclsrc=aw.ds",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/radison-colombo.jpg",
      "slug": "radison-colombo"
    },
    {
      "name": "Emirates Lounge at Katunayaka Airport",
      "featured": "no",
      "year": 2012,
      "scope": "Lighting control System",
      "description": "At Radisson Hotel Colombo, Onco Solutions delivered a complete lighting solution across key areas including the Banquet Hall, All Day Dining, Pool & Bar, and the Entrance Lobby. Our team handled the full supply and installation process, integrating advanced C-Bus lighting controls to enhance ambiance, functionality, and energy efficiency throughout the space.",
      "clientUrl": "https://www.emirates.com/lk/english/experience/our-lounges/business-class/",
      "location": "Katunayaka, Sri Lanka",
      "imageUrl": "/images/projects/emirates-lounge-cmb.jpg",
      "slug": "emirates-lounge-cmb"
    },
    {
      "name": "TAJ Bentota",
      "featured": "no",
      "year": 2012,
      "scope": "Guest Room Control System for Rooms",
      "description": "At TAJ Vivanta in Bentota, Sri Lanka, Onco Solutions delivered a seamless guest room control system installation, enhancing comfort and energy efficiency. This project featured the integration of Schneider ELV systems, ensuring reliable performance and intelligent room automation tailored for premium hospitality.",
      "clientUrl": "https://www.tajhotels.com/en-in/hotels/taj-bentota-sri-lanka?utm_source=Google&utm_medium=Local&utm_campaign=Taj-Bentota-Sri-Lanka",
      "location": "Benthota, Sri Lanka",
      "imageUrl": "/images/projects/taj-bentota.jpg",
      "slug": "taj-bentota"
    },
    {
      "name": "Jetwing Blue Negombo",
      "featured": "no",
      "year": 2012,
      "scope": "Banquet Lighting Control System",
      "description": "Onco Solutions proudly delivered the supply and installation of advanced banquet lighting controls at Jetwing Blue in Negombo, Sri Lanka. Our system enables smooth dimming of both fluorescent and CFL lighting, creating the perfect ambiance for every event hosted in this elegant beachfront venue.",
      "clientUrl": "https://www.jetwinghotels.com/jetwingblue/",
      "location": "Negombo, Sri Lanka",
      "imageUrl": "/images/projects/jetwing-blue.jpg",
      "slug": "jetwing-blue"
    },
    {
      "name": "Banquet of Ramada Colombo",
      "featured": "no",
      "year": 2011,
      "scope": "Banquet Lighting Control System",
      "description": "At Ramada Hotel - Banquet, Colombo, Sri Lanka, Onco Solutions delivered a seamless lighting transformation with the supply and installation of advanced banquet lighting controls. Designed for elegance and efficiency, our system enhances ambiance and ensures effortless control, setting the perfect tone for every event.",
      "clientUrl": "https://www.wyndhamhotels.com/ramada",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/ramada-colombo.jpg",
      "slug": "ramada-colombo"
    },
    {
      "name": "Como Resort Maalifushi",
      "featured": "yes",
      "year": 2010,
      "scope": "Villa Lighting Control System",
      "description": "Onco Solutions completed the supply and installation of luxury lighting control systems at COMO Maalifushi, Maldives. Designed to complement the resort’s refined aesthetic, our solution brings effortless ambiance and intuitive control to each private villa.",
      "clientUrl": "https://www.comohotels.com/maldives/como-maalifushi",
      "location": "Maalifushi, Maldives",
      "imageUrl": "/images/projects/como-maalifushi.jpg",
      "slug": "como-maalifushi"
    },
    {
      "name": "Uga - Ulaglla Resort",
      "featured": "yes",
      "year": 2010,
      "scope": "Villa Lighting Control System",
      "description": "At Uga Ulagalla Resort in Thirappane, Anuradhapura, Onco Solutions completed the supply and installation of smart lighting controls for the resort’s luxury villas. Powered by C-Bus technology, the system blends sophisticated control with serene ambiance, elevating the guest experience in this iconic destination.",
      "clientUrl": "https://www.ugaescapes.com/ulagalla/gallery.html",
      "location": "Anuradhapura, Sri Lanka",
      "imageUrl": "/images/projects/ulagalla-resort.jpg",
      "slug": "ulagalla-resort"
    },
    {
      "name": "Tri-Zen Luxury Apartments",
      "featured": "yes",
      "year": 2025,
      "scope": "Smart Home Solution",
      "description": "At Tri-Zen Luxury Apartments in Colombo, Sri Lanka, Onco Solutions delivered a complete smart home experience through the supply, installation, programming, and commissioning of advanced apartment automation systems. Each unit is seamlessly equipped with intuitive smart technology, enhancing modern living with comfort, security, and convenience at the heart of the design.",
      "clientUrl": "https://www.trizen.lk/",
      "location": "Colombo, Sri Lanka",
      "imageUrl": "/images/projects/tri-zen-colombo.jpg",
      "slug": "tri-zen-colombo"
    }
    
  ]